{
  "metadata-title": "Kevin Lacroix | Freelance Web Developer",
  "metadata-description": "Kevin Lacroix | Freelance Web Developer | Expertise on Front-end development: HTML5/CSS3 integration & Javascript interactivities",
  "work": "Work",
  "skills": "Skills",
  "employment": "Employment",
  "about": "About",
  "references": "References",
  "contact": "Contact",
  "close-menu": "Close Menu",
  "open-menu": "Open Menu",
  "page-title": "Freelance Web Developer",
  "legacy-browser": "You need a browser that supports CSS Grid Layouts to see this section properly. Please update your browser :)",

  "work-title": "Recent work",
  "work-intro": "After five years of corporate and agency experience, I made the decision to become a full-time Freelance Web Developer. My previous employments allowed me to work on a variety of large and small projects that kept me challenged and working with the latest techniques and technologies. My expertise mainly focuses on Front-end and interactive development.",
  "see-more": "See more",
  "eta-excerpt": "The project is a new website for the Griffin's Food Company",
  "ftv-excerpt": "The project is a complete redesign of the sport platform",
  "univadis-excerpt": "The website is a platform dedicated to doctors from different trades",
  "chanel-excerpt": "The project consisted in the implementation of widgets on a single page",
  "chaumet-excerpt": "The project is a complete redesign of the Chaumet website",
  "traceone-excerpt": "Application allowing a better visibility on the supply chain of products",
  "jll-excerpt": "Simple blog designed with Photoshop and built with Drupal 8",
  "les-evades-excerpt": "The project is a complete redesign of the agency website",
  "instachef-excerpt": "The project is a platform linking cooks and customers",
  "eco-verdure-excerpt": "Website creation for a company that offers landscaping services",
  "norclair-excerpt": "Website creation for a company specialized in the building industry",
  "folio-excerpt": "Website creation for an add-on vendor within the Atlassian ecosystem",
  "pcg-excerpt": "This project is a website creation for a real estate agency",
  "ssj-excerpt": "Website creation for a foundation that helps students",
  "clinic-excerpt": "The project is a single page showcase website for a medical clinic",
  "crossfit-excerpt": "Website creation for a fitness center that offers coached and supervised group classes",

  "tagline-one-a": "a developer to work on your projects",
  "tagline-one-b": "use the latest technologies",
  "tagline-two-a": "a Freelance to maintain your websites",
  "tagline-two-b": "provide good advice on new features",
  "tagline-three-a": "a Freelance Web Developer",
  "tagline-three-b": "meet your deadlines",
  "tagline-base-a": "You are looking for",
  "tagline-base-b": "Able to",

  "skills-title": "Professional skills",
  "skills-txt": "Disciplined at following the Web best practices, I am continually seeking to improve my quality of code. I have a proficient understanding of cross-browser compatibility issues and ways to work around them. I have sound skills using Gulp or Webpack to optimise applications for maximum performance and scalability. Previous experience abroad gave me good communication skills in english, both written and verbal.",
  "web-design": "Web Design",
  "english": "English",
  "open-minded": "Open-minded",
  "creativity": "Creativity",
  "methodical": "Methodical",
  "inquisitive": "Inquisitive",
  "cooking": "Cooking",

  "experience-title": "Experience",
  "experience-txt": "I had the opportunity to progress my professional career as a Front-end developer, working on interesting and technically challenging projects. Passionate about combining the art of design with the art of programming, I enjoy translating web designs into code. I have an eye for meticulous detail and a focus on continuous improvement.",
  "july": "July",
  "improved-skills": "Improved skills",
  "heyday-desc": "Web agency, 50 to 60 employees, Auckland, New Zealand",
  "skill-methodologies": "Atomic Design & BEM methodologies",
  "may": "May",
  "neolynk-desc": "IT services company, 50 to 70 employees, Paris, France",
  "skill-twig": "Use of Twig Templating Engine on Symfony3 framework",
  "skill-api": "Fetch and display data from an API",
  "skill-bem": "Atomic Design integration / Creation of CSS components with BEM and OOCSS methodology",
  "skill-agile": "Agile methodologies",
  "evades-desc": "Advertising agency, 20 to 30 employees, Montreal, Canada",
  "skill-preprocessors": "Use of Sass and Stylus preprocessors",
  "skill-microdata": "Use of HTML5 Microdata",
  "skill-workflow": "Workflow automation with Gulp",
  "skill-angular": "Use of Angular",
  "march": "March",
  "hoffmann-desc": "Digital agency, 20 to 30 employees, Montreal, Canada",
  "skill-responsive": "HTML5 / CSS3 responsive integration",
  "skill-interactivity": "Front-end interactivity and animation with jQuery",
  "skill-git": "Code Versionning with Git",
  "skill-wordpress": "Theme creation with Wordpress",
  "skill-laravel": "Templating on Laravel framework",
  "acolyte-desc": "Web agency, 20 to 30 employees, Trois-Rivières, Canada",
  "skill-less": "Use of Less preprocessors",
  "skill-bootstrap": "Use of Bootstrap UX framework",
  "skill-sprites": "Use of SVG sprites",
  "skill-polyfills": "Use of Polyfills for IE8 support",
  "skill-w3c": "W3C standards",

  "about-me-title": "About me",
  "about-me-intro": "Originally from Paris, France, I studied Web Development in Canada. I enjoyed the relaxed life style and stayed there after my graduation to get some work experience in web development. Then, I came back to Paris, where I worked for almost 3 years. Eager to travel again, I went to work in New Zealand around the end of 2017 with a Working Holiday Visa. I am now working as a full-time Freelance Web Developer. Beside my enthusiasm about the Web and emerging technologies, I like sport, hiking, travelling, photography, board games, cinema and exhibitions.",

  "references-title": "They trusted me",
  "references-intro": "I have worked within an IT services company where I was put on different assignments working with clients from different fields. I had the opportunity to work on heavy traffic websites for a media group and a pharmaceutical company. I also worked for two notorious companies in the luxury sector where pixel-perfect layouts and great performance are a requirement. Working in Canada and in New Zealand, I had the opportunity to work in web agencies, on smaller but not less diverse projects.",

  "tasks": "Tasks and duties:",
  "check-website": "Check the website",
  "close-project": "Close project",
  "stack": "Technical stack:",
  "task-silverstripe": "Use of Silverstripe CMS and its Templating Engine",
  "task-docker": "Use of Docker",
  "task-bem": "HTML/CSS integration following BEM & atomic design principles",
  "task-es6": "Improved skills in Vanilla JS and ES6",

  "modal-ftv-txt": "With 5 national television channels, 24 regional branches, 9 ultramarine antennas and a full range of digital services, France Télévisions is the leading French public service audiovisual group. This project is a complete redesign of the sport platform. I arrived on this assignment at the very begining of the project and I was the only one Front-end developer. There was 4 Back-end developers.",
  "task-workflow": "Workflow automation with Gulp for Front-end asset generation allowing maximum performance",
  "task-inte-atomic": "HTML/CSS integration following atomic design principles",
  "task-styleguide": "Styleguide creation of atoms/molecules/organisms with the use of Hologram, allowing quality validation",
  "task-symfony": "Use of Twig Templating Engine on Symfony3 framework",
  "task-seo": "Improved skills in SEO (HTML5 standards, AMP, Charbeat, JSONLD, microdata...)",
  "task-vanilla-js": "Improved skills in Vanilla JS, ES6 (Babel) and Ajax",
  "task-agile": "Worked in Agile / Scrum environments, used Jira",
  "task-drupal-8": "Use of Drupal 8 Back Office",

  "modal-univadis-txt": "Univadis project is a heavy traffic website that below to Aptus Health (Merck), a pharmaceutical company. The website is a platform dedicated to doctors from different trades. It allows them to access to a large base of content divided in 3 main sections: News, Reference, Education (interactive quizz). There were 6 to 8 Back-end developers and we were 2 Front-end developers. The different parties of the team being in different locations, the communication and the Agile meetings were done by calls and webcam. When I arrived, the project had already started since one year.",
  "task-redesign": "Redesign of the old platform with specificities for each countries",
  "task-sketch": "Use of Sketch and Zeplin for layout integration",
  "task-components": "Creation of CSS components using BEM and OOCSS methodology",
  "task-twig": "Use of Twig Templating Engine in a Symfony2 environment",
  "task-ajax": "Use of jQuery, Ajax, Vanilla JS",
  "task-job-interview": "Job interviewing to assess new candidates skills",

  "chanel-txt": "Chanel is a high fashion house that specializes in “haute couture” and ready-to-wear clothes, luxury goods and fashion accessories. For this project, I implemented some widgets on a single page that needed to be independent. The client wanted to be able to add them or remove them from a Back Office.",
  "task-responsive": "HTML5 / CSS3 responsive integration",
  "task-jquery": "Use of jQuery",
  "task-multilingual": "Handle multi-lingual support",

  "chaumet-txt": "Chaumet is a parisian jeweller since 1780. It sells high jewellery and watches in many boutiques in the world main capital cities. This project is a redesign of the Chaumet website.",
  "task-interactivity": "Interactivity with jQuery",
  "task-theming": "Theming on Drupal 7",

  "traceone-txt": "The project is an application allowing manufacturers, retailers and providers to have a better visibility on the products supply chains. The Backend is in .Net and the Front-end in AngularJS. Both sides communicate via a REST API.",
  "task-dot-net": "Work in .NET environment (Visual Studio, TFS)",
  "task-refactoring": "CSS refactoring to create independent components for each module, using DoCSSa methodology (inspired of BEM methodology, components are created via Sass mixins)",
  "task-phabricator": "Use of Phabricator as a code review tool",
  "task-angular": "Basic use of AngularJS to fetch data on a REST API via GET calls",
  "task-browserify": "Basic understanding of Browserify, Parcelify",

  "jll-txt": "This project is a simple blog designed with Photoshop and built with Drupal 8 for a sibling. I did this blog with Drupal 8 in order to get a better understanding of that new technology. At that time, Drupal 8 was still in its Beta Version.",
  "fields-improvements": "Fields of improvements:",
  "task-web-design": "Web design, Photoshop",
  "task-site-building": "Site building and theme creation on Drupal 8",
  "task-d8-modules": "Use of the Drupal 8 contrib modules: Devel, Crop, Media, Video, Form...",
  "task-yeoman": "Workflow automation with Gulp, based on Yeoman gulp-webapp",

  "les-evades-txt": "Les Evadés is the advertising agency I was working in. This project was the redesign of the agency website. The challenge was to learn and use AngularJS for this project. We were 2 developers working on this project.",
  "task-preprocessors": "Use of Sass and Stylus preprocessors",
  "task-microdata": "Use of HTML5 Microdata",
  "task-workflow-ng": "Workflow automation with Gulp / Use of Yeoman gulp-angular",
  "task-directives": "Basic use of Angular: creation of directives and use of Angular core directives, use of Angular PictureFill",
  "task-svg-anim": "Interactive animation using SVG, jQuery and CSS3",
  "task-jquery-plugin": "Development of a jQuery slider plugin that would always fit to the height of the window and remain responsive",
  "task-map": "Use of Google Map, YouTube and Vimeo API",

  "instachef-txt": "The project was the creation of a new website for a client of Hoffman Agency. The concept was to connect together cooks and customers for events.",

  "eco-verdure-txt": "The project was the creation of a new website for a client of Hoffman Agency. Eco-Verdure Inc. is a company that offers a full range of landscape design, construction and maintenance services.",

  "norclair-txt": "The project was the creation of a new website for a client of Hoffman Agency. Norclair Inc. offers solutions for the installation, renovation, upgrading and commissioning of pumping stations, filtration and water treatment plants, waste treatment, the construction of reservoirs and more.",

  "folio-txt": "The project was the creation of a new website for a client of Hoffman Agency. Folio for Jira was an add-on vendor within the Atlassian ecosystem.",

  "pcg-txt": "The project was the creation of a new website for a client of Hoffman Agency. PCG Carmon is a real estate agency that provides assessments of real estate and equipment for the purposes of financing, insurance, litigation, sharing, expropriation, relocation, acquisition-disposition...",

  "ssj-txt": "The project was the creation of a new website for a client of Acolyte Communication. SSJ Foundation has a mission to help students. It also helps to finance school renovations or school services",

  "clinic-title": "Medical clinic 1900",
  "clinic-txt": "The project was the creation of a new website for a client of Acolyte Communication. It is a single page showcase website. Medical clinic 1900 is a private clinic.",

  "crossfit-txt": "The project was the creation of a new website for a client of Acolyte Communication. The website presents the crossfit club and allow to make a reservation for a course.",

  "contact-title": "Contact me",
  "contact-intro": "You are interested in my profile ? You think you may have a project for me ? You have a question regarding a new feature ? Feel free to use the form below to send me a message.",
  "name": "Name",
  "phone-number": "Phone number",
  "email": "Email",
  "company": "Company",
  "subject": "Subject",
  "message": "Message",
  "send": "Send",

  "copyrights-reserved": "All rights reserved"
}
