{
  "metadata-title": "Kevin Lacroix | Développeur Web Freelance",
  "metadata-description": "Kevin Lacroix | Développeur Web Freelance | Expertise sur le développement Front-end: intégration HTML5/CSS3 & interactivés en Javascript",
  "work": "Projets",
  "skills": "Compétences",
  "employment": "Expérience",
  "about": "À Propos",
  "references": "Références",
  "contact": "Contact",
  "close-menu": "Fermer le Menu",
  "open-menu": "Ouvrir le Menu",
  "page-title": "Développeur Web Freelance",
  "legacy-browser": "Vous avez besoin d'un navigateur qui supporte les CSS Grid Layouts pour voir cette section correctement. SVP updatez votre navigateur :)",

  "work-title": "Projets récents",
  "work-intro": "Après cinq ans d’expérience en entreprise et en agence, j’ai pris la décision de devenir un développeur Web indépendant à temps complet. Lors de mes emplois précédents, j'ai pu travailler sur divers projets de petites et grandes envergures, ce qui m'a permis de relever différents défis en travaillant avec les dernières techniques et technologies. Mon expertise se concentre principalement sur le développement frontend.",
  "see-more": "Voir plus",
  "eta-excerpt": "Nouveau site internet pour la compagnie Griffin's",
  "ftv-excerpt": "Refonte complète de la platforme FranceTV Sport",
  "univadis-excerpt": "Platforme dédiée aux docteurs de différents corps de métiers",
  "chanel-excerpt": "Implémentation d'une série de widgets sur une single page",
  "chaumet-excerpt": "Refonte complète du site internet de la joaillerie Chaumet",
  "traceone-excerpt": "Application permettant une meilleure visibilité de la chaîne d'approvisionnement de produits",
  "jll-excerpt": "Design d'un blog fait sous Photoshop et développement avec Drupal 8",
  "les-evades-excerpt": "Refonte du site internet de l'agence Les Évadés",
  "instachef-excerpt": "Platforme qui met en contact des cuisiniers et des particuliers",
  "eco-verdure-excerpt": "Création d'un site web pour une companie qui offre des services de jardinerie",
  "norclair-excerpt": "Création d'un site web pour une companie spécialisée dans le bâtiment",
  "folio-excerpt": "Création d'un site web pour un fournisseur de l'écosystème Atlassian",
  "pcg-excerpt": "Création d'un site web pour une agence immobilière",
  "ssj-excerpt": "Création d'un site web pour une fondation qui a pour mission d’aider des étudiants",
  "clinic-excerpt": "Création d'un site vitrine pour une clinique médicale",
  "crossfit-excerpt": "Création d'un site web pour un centre de fitness",

  "tagline-one-a": "pour travailler sur vos projets",
  "tagline-one-b": "respecter vos délais",
  "tagline-two-a": "pour maintenir vos sites internet",
  "tagline-two-b": "fournir de bons conseils",
  "tagline-three-a": "Freelance sérieux",
  "tagline-three-b": "utiliser les dernières technologies",
  "tagline-base-a": "Vous cherchez un développeur",
  "tagline-base-b": "capable de",

  "skills-title": "Compétences professionnelles",
  "skills-txt": "Discipliné à suivre les meilleures pratiques du Web, je cherche continuellement à améliorer la qualité de mon code. J'ai une connaissance approfondie des problèmes liés aux compatibilités entre navigateurs et des moyens de les contourner. J'ai de bonnes compétences pour utiliser des outils tels que Gulp ou Webpack pour optimiser les performances d'une application et assurer sa maintenabilité dans le temps. Mes expériences à l'étranger m'ont permis de parler anglais couramment.",
  "web-design": "Design Web",
  "english": "Anglais",
  "open-minded": "Ouvert d'esprit",
  "creativity": "Créatif",
  "methodical": "Méthodique",
  "inquisitive": "Curieux",
  "cooking": "Cuisine",

  "experience-title": "Expérience",
  "experience-txt": "J'ai eu l'opportunité de faire progresser ma carrière professionnelle en tant que développeur front-end, travaillant sur des projets intéressants et techniquement complexes. Passionné de combiner l'art du design avec l'art de la programmation, j'aime traduire les conceptions Web en code. Je suis attentif aux détails et à l'amélioration continuelle de mon code.",
  "july": "Juillet",
  "improved-skills": "Compétences améliorées:",
  "heyday-desc": "Agence Web, 50 à 60 employés, Auckland, Nouvelle-Zélande",
  "skill-methodologies": "Méthodologies BEM & Atomic Design",
  "may": "Mai",
  "neolynk-desc": "SSII, 50 à 70 employés, Paris, France",
  "skill-twig": "Utilisation du moteur de template Twig sur le framework Symfony3",
  "skill-api": "Récupération de data depuis une API",
  "skill-bem": "Integration Atomic Design, création de composants CSS avec les méthodologies BEM ou OOCSS",
  "skill-agile": "Méthodologie Agile",
  "evades-desc": "Agence de publicité, 20 à 30 employés, Montréal, Canada",
  "skill-preprocessors": "Utilisation des préprocesseurs Sass et Stylus",
  "skill-microdata": "Utilisation des Microdata HTML5",
  "skill-workflow": "Automatisation d'un workflow avec Gulp",
  "skill-angular": "Utilisation d'Angular",
  "march": "Mars",
  "hoffmann-desc": "Agence Web, 20 à 30 employés, Montréal, Canada",
  "skill-responsive": "Intégration responsive HTML5 / CSS3",
  "skill-interactivity": "Intéractivités Front-end et animations avec jQuery",
  "skill-git": "Versionning du code avec Git",
  "skill-wordpress": "Création de thèmes avec Wordpress",
  "skill-laravel": "Templating avec le framwork Laravel",
  "acolyte-desc": "Agence Web, 20 à 30 employés, Trois-Rivières, Canada",
  "skill-less": "Utilisation du préprocesseur Less",
  "skill-bootstrap": "Utilisation du framwork UX Bootstrap",
  "skill-sprites": "Utilisation des sprites SVG",
  "skill-polyfills": "Utilisation de polyfills pour assurer le support sur IE 8",
  "skill-w3c": "Standards W3C",

  "about-me-title": "À Propos",
  "about-me-intro": "Originaire de Paris, France, j'ai étudié le développement Web au Canada. J'ai apprécié le style de vie détendu et j'y suis resté après l'obtention de mon diplôme pour acquérir une expérience professionnelle dans le développement web. Je suis ensuite revenu à Paris où j'ai travaillé près de 3 ans. Désirant voyager à nouveau, je suis allé travailler en Nouvelle-Zélande vers la fin de 2017 avec un visa vacances-travail. Je travaille maintenant en tant que développeur Web indépendant à temps plein. Outre mon enthousiasme pour le Web et les technologies émergentes, j'aime le sport, la randonnée, les voyages, la photographie, les jeux de société, le cinéma et les expositions.",

  "references-title": "Ils m'ont fait confiance",
  "references-intro": "J'ai travaillé au sein d'une SSII où j'ai été affecté en missions chez des clients de différents domaines. J'ai par exemple eu l'occasion de travailler sur des sites Web à fort trafic pour un groupe de médias et une entreprise pharmaceutique. J'ai également travaillé pour des entreprises notoires dans le secteur du luxe où des mises en page parfaites en termes de pixels et de grandes performances sont nécessaires. Travaillant au Canada et en Nouvelle-Zélande, j'ai eu l'occasion de travailler dans des agences Web, sur des projets plus petits mais non moins diversifiés.",

  "tasks": "Tâches et accomplissements:",
  "check-website": "Voir le site web",
  "close-project": "Fermer le projet",
  "stack": "Stack technique:",
  "task-silverstripe": "Utilisation du CMS Silverstripe et de son moteur de template",
  "task-docker": "Utilisation de Docker",
  "task-bem": "Intégration HTML/CSS suivant les principes BEM & Atomic Design",
  "task-es6": "Amélioration des compétences en JS natif et ES6",

  "modal-ftv-txt": "Avec 5 chaînes de télévision nationales, 24 agences régionales, 9 antennes Outre-mer et une gamme complète de services numériques, France Télévisions est le premier groupe audiovisuel de service public français. Ce projet est une refonte complète de la plateforme sportive. Je suis arrivé sur cette mission au tout début du projet et j'étais le seul développeur Front-End. Il y avait 4 développeurs back-end.",
  "task-workflow": "Automatisation d'un workflow avec Gulp pour la génération des assets du Front-end, permettant un maximum de performance",
  "task-inte-atomic": "Intégration HTML/CSS en suivant les principes de l'Atomic Design",
  "task-styleguide": "Création d'un styleguide avec Hologram pour la séparation des composants: atomes, molécules et organismes",
  "task-symfony": "Utilisation du moteur de template Twig sur le framwork Symfony3",
  "task-seo": "Amélioration des compétences SEO (HTML5 standards, AMP, Charbeat, JSONLD, microdata...)",
  "task-vanilla-js": "Amélioration des compétences en JS natif, ES6 (Babel) et Ajax",
  "task-agile": "Travail en Méthodologie Agile / Scrum, utilisation de Jira",
  "task-drupal-8": "Utilisation du Back Office Drupal 8",

  "modal-univadis-txt": "Le projet Univadis est un site Web à fort trafic qui appartient à Aptus Health (Merck), une société pharmaceutique. Le site Web est une plateforme dédiée aux médecins de différents corps de métiers. Il leur permet d'accéder à une large base de contenu divisée en 3 sections principales: Actualités, Référence, Education (quizz interactif). Il y avait 6 à 8 développeurs Back-end et nous étions 2 développeurs Front-end. Les différentes parties de l'équipe se trouvant dans des lieux différents, les réunions Agile se faisaient essentiellement via conf call. Lorsque je suis arrivé, le projet avait déjà commencé depuis un an.",
  "task-redesign": "Refonte de l'ancienne plateforme avec des spécificités pour chaque pays",
  "task-sketch": "Utilisation de Sketch et Zeplin",
  "task-components": "Création de composants CSS utilisant la méthodologie BEM et OOCSS",
  "task-twig": "Utilisation du moteur de template Twig dans un environnement Symfony2",
  "task-ajax": "Utilisation de jQuery, Ajax, Vanilla JS",
  "task-job-interview": "Entretiens pour évaluer les compétences des nouveaux candidats",

  "chanel-txt": "Chanel est une entreprise française de luxe productrice de haute couture, ainsi que de prêt-à-porter, accessoires, parfums et divers produits. Pour ce projet, j'ai implémenté des widgets indépendants les uns des autres sur une single page. Le client voulait pouvoir les activer/désactiver au besoin depuis son back office.",
  "task-responsive": "Intégration responsive HTML5 / CSS3",
  "task-jquery": "Utilisation de jQuery",
  "task-multilingual": "Gérer le support multilingue",

  "chaumet-txt": "Chaumet est une maison française de joaillerie, de bijouterie et d’horlogerie fondée en 1780. Cette entreprise possède de nombreuses boutiques dans le monde entier. Ce projet est une refonte de leur site web.",
  "task-interactivity": "Interactivités avec jQuery",
  "task-theming": "Theming sur Drupal 7",

  "traceone-txt": "Le projet est une application permettant aux fabricants, aux détaillants et aux fournisseurs d’avoir une meilleure visibilité sur les chaînes d’approvisionnement des produits. Le backend est dans .Net et le front-end dans AngularJS. Les deux parties communiquent via des API REST.",
  "task-dot-net": "Travail dans un environnement .NET (Visual Studio, TFS)",
  "task-refactoring": "Refactoring CSS pour créer des composants indépendants pour chaque module, en utilisant la méthodologie DoCSSa (inspirée de la méthodologie BEM, les composants sont créés via des mixins Sass)",
  "task-phabricator": "Utilisation de Phabricator comme outil de révision de code",
  "task-angular": "Utilisation d'AngularJS pour récupérer des données sur une API REST via des appels GET",
  "task-browserify": "Compréhension de Browserify et Parcelify",

  "jll-txt": "Ce projet est un blog pour un proche. Le design a été fait sous Photoshop puis l'intégration s'est faite via la création d'un thème Drupal 8. Ce projet m'a permis d'améliorer mes connaissances sur cette nouvelle technologie. Au moment du développement, Drupal 8 était toujours dans sa version bêta.",
  "fields-improvements": "Axes d'amélioration:",
  "task-web-design": "Design Web, Photoshop",
  "task-site-building": "Site building et création de thème sur Drupal 8",
  "task-d8-modules": "Utilisation de modules Drupal 8 : Devel, Crop, Media, Video, Form...",
  "task-yeoman": "Automatisation d'un workflow avec Gulp, basé sur Yeoman gulp-webapp",

  "les-evades-txt": "Les Évadés est l'agence de publicité dans laquelle je travaillais. Ce projet était la refonte du site de l'agence. Le défi était d'apprendre et d'utiliser AngularJS pour ce projet. Nous étions 2 développeurs travaillant sur ce projet.",
  "task-preprocessors": "Utilisation des préprocesseurs Sass et Stylus",
  "task-microdata": "Utilisation des Microdata HTML5",
  "task-workflow-ng": "Workflow automation with Gulp / Use of Yeoman gulp-angular",
  "task-directives": "Utilisation d'Angular: création de directives et utilisation des directives du core d'Angular, utilisation d'Angular PictureFill",
  "task-svg-anim": "Animation utilisant les SVG, jQuery et CSS3",
  "task-jquery-plugin": "Développement d'un plugin jQuery Slider qui s'adapterait toujours à la hauteur de la fenêtre et restait responsive",
  "task-map": "Utilisation des API Google Map, YouTube et Vimeo",

  "instachef-txt": "Le projet consistait à créer un nouveau site Web pour un client de l’agence Hoffman. Le concept était de connecter les cuisiniers et les clients pour les événements.",

  "eco-verdure-txt": "Le projet consistait à créer un nouveau site Web pour un client de l’agence Hoffman. Eco-Verdure Inc. est une entreprise qui offre une gamme complète de services d’aménagement, de construction et d’entretien de paysages.",

  "norclair-txt": "Le projet consistait à créer un nouveau site Web pour un client de l’agence Hoffman. Norclair Inc. offre des solutions pour l'installation, la rénovation, la mise à niveau et la mise en service de stations de pompage, de stations de filtration et de traitement des eaux, le traitement des déchets, la construction de réservoirs, etc.",

  "folio-txt": "Le projet consistait à créer un nouveau site Web pour un client de l’agence Hoffman. Folio for Jira était un fournisseur complémentaire de l'écosystème Atlassian.",

  "pcg-txt": "Le projet consistait à créer un nouveau site Web pour un client de l’agence Hoffman. PCG Carmon est une agence immobilière qui évalue l'immobilier et l'équipement à des fins de financement, d'assurance, de litige, de partage, d'expropriation, de relocalisation, de cession-acquisition...",

  "ssj-txt": "Le projet consistait à créer un nouveau site Web pour un client d’Acolyte Communication. La Fondation SSJ a pour mission d’aider les étudiants. Il aide également à financer des rénovations scolaires ou des services scolaires.",

  "clinic-title": "Clinique Médicale 1900",
  "clinic-txt": "Le projet consistait à créer un nouveau site Web pour un client d’Acolyte Communication. C'est un site Web de vitrine d'une seule page. La clinique médicale 1900 est une clinique privée.",

  "crossfit-txt": "Le projet consistait à créer un nouveau site Web pour un client d’Acolyte Communication. Le site présente le club de crossfit et permet de réserver un cours.",

  "contact-title": "Contactez-moi",
  "contact-intro": "Mon profile vous intéresse ? Vous pensez avoir un projet pour moi ? Vous avez une question concernant une nouvelle fonctionnalité ? N'hésitez pas à utiliser le formulaire ci-dessous pour m'envoyer un message.",
  "name": "Nom",
  "phone-number": "Numéro de téléphone",
  "email": "Email",
  "company": "Companie",
  "subject": "Sujet",
  "message": "Message",
  "send": "Envoyer",

  "copyrights-reserved": "Tous droits réservés"
}
